Revit 2027 API
Truss.DropTruss Method
Drop truss Family, it will disassociate all members from the truss and delete the truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void DropTruss(
	Truss truss
)
Public Shared Sub DropTruss (
	truss As Truss
)
public:
static void DropTruss(
	Truss^ truss
)
static member DropTruss :
        truss : Truss -> unit
Parameters
truss Truss
The truss to be dropped.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace